[ProxMinePGTech X2TechTemplate]
DisplayName="Proximity Mines"
Summary="By utilising the Andromedon robotic shell's motion detection system, we can create a grenade based weapon of considerable power. Due to the methods used to detect enemy movement, creating more than one of these could prove fatal.\nThankfully our units can deploy this mine without breaking concealment and any unfortunate enemies caught in the resulting blast will not be able to discern the originators location.\nAlthough the proximity blast will not trigger for the passing of our own troops, if caught within the radius at detonation they may still take damage.\nWe might be able to share this new detonation method with our Reaper Allies for use on their Claymore mines."
CodeName="RustyLevineMine"
LongDescription="By utilising the Andromedon robotic shell's motion detection system, we can create a grenade based weapon of considerable power. Due to the methods used to detect enemy movement, creating more than one of these could prove fatal.\nThankfully our units can deploy this mine without breaking concealment and any unfortunate enemies caught in the resulting blast will not be able to discern the originators location.\nAlthough the proximity blast will not trigger for the passing of our own troops, if caught within the radius at detonation they may still take damage.\nWe might be able to share this new detonation method with our Reaper Allies for use on their Claymore mines."

[ThrowProximityCLAYMORE X2AbilityTemplate]
LocFriendlyName="Claymore (Proximity)"
LocHelpText="Throw a non-concealment breaking claymore that explodes on enemy movement."
LocLongDescription="Throw an non-concealment breaking claymore that explodes on enemy movement."
LocFriendlyNameWhenConcealed="Claymore (Proximity)"
LocLongDescriptionWhenConcealed="Throw a non-concealment breaking claymore that explodes on enemy movement."

[XcomProximityCLAYMORE X2WeaponTemplate]
FriendlyName="Claymore (Proximity)"
FriendlyNamePlural="Claymores (Proximity)"
BriefSummary="This powerful proximity claymore is perfect for disabling groups of enemies before our soldier's ambushes begin."
TacticalText="<Bullet/>Throwing a proximity claymore will not break a soldier's concealment.<br><Bullet> This set will give one bonus Proximity Claymore for use in missions. It will not affect the Reapers standard Claymore uses.<br><Bullet/>Proximity claymores are not triggered by friendly units, but if caught within the Claymore's blast radius, friendly units will be damaged."

[AutopsyAndromedon X2TechTemplate]
-Summary="The beings that inhabit these suits clearly come from an environment utterly hostile to humans. The corrosive substance they use as a weapon may be the equivalent to water for them - but on this planet it's deadly. I've theorized as to how the substance could somehow be used to our advantage as part of an explosive weapons system."
+Summary="The beings that inhabit these suits clearly come from an environment utterly hostile to humans. The corrosive substance they use as a weapon may be the equivalent to water for them - but on this planet it's deadly. I've theorized as to how the robotic shell movement detection subsystems can be used to create an automated explosive weapons system.\n This new mine will help our units retain any concealment they might still possess, before and after explosive deployment. The mine will cause extreme damage to any enemy units passing nearby."
